Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིགས་པ་དང་ལྡན་པ་དང་རིགས་པ་དང་ལྡན་པ་མ་ཡིན་པ་ལ་ཞེ་སྡང་མེད་པའོ། །
en: “It is harboring no anger toward the rational or irrational,

source: ཕ་རོལ་གྱི་སྡེ་རྙེད་པ་ལ་མི་གནས་པའོ། །
en: not relying on the wealth of other groups,

source: བསམ་པ་རྫོགས་པར་བྱ་བ་མི་སྤོང་བའོ། །
en: never failing to fulfill wishes,

source: ང་རྒྱལ་སྤོང་བའོ། །
en: giving up pride,

source: ཁོང་ཁྲོ་བ་སྤོང་བའོ། །
en: giving up anger,

source: གཏི་མུག་ཡང་དག་པར་འཇོམས་པའོ། །
en: and conquering ignorance.

source: རྙེད་པ་ལ་ཀུན་ཏུ་མི་སྤྱོད་པའོ། །
en: It is not enjoying wealth,

source: ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་པའོ། །
en: being content with bare necessities,

source: ཤེས་ཀྱི་ཁེ་སྤོང་བའོ། །
en: abandoning worldly pursuits,

source: མ་རྙེད་པ་ལ་མི་དགའ་བ་མེད་པའོ། །
en: not being displeased with not getting wealth,

source: རྙེད་པས་ཁེངས་པ་མེད་པའོ། །
en: not becoming conceited at getting wealth,

source: ཅི་རྙེད་པ་ལ་བགོ་བཤའི་ངང་ཚུལ་ཅན་ཉིད་དོ། །
en: sharing whatever one obtains,

source: སྩོགས་པར་མི་བྱེད་པ་ཉིད་དོ། །
en: and not hoarding.

source: མི་སྙན་པར་ཟེར་བ་དང་དུ་ལེན་པ་ཉིད་དོ། །
en: It is accepting negative words from others,

source: ཚིག་བསྲུང་བའོ། །
en: guarding one’s words,

source: བློ་གསལ་བར་བྱེད་པའོ། །
en: being clear minded,

source: རིགས་པ་དང་ལྡན་པ་ལ་སྐུལ་མ་འདེབས་པའོ། །
en: encouraging those who are rational,

source: རིགས་པ་དང་ལྡན་པ་མ་ཡིན་པ་ལ་མི་རྟེན་པའོ། །
en: not following those who are irrational,

source: ཕྱིར་ཞིང་འདྲི་བའོ། །
en: and practicing sustained inquiry.

source: ནང་དུ་ཡང་དག་འཇོག་མི་སྤོང་བའོ། །
en: It is not giving up meditative seclusion,

source: དགོན་པ་ཡོངས་སུ་མི་གཏོང་བའོ། །
en: not leaving the wilderness,

source: རྟག་ཏུ་སྦྱངས་པའི་ཡོན་ཏན་ལ་གནས་པའོ། །
en: always practicing the ascetic virtues,

source: སྟོང་པ་ཉིད་ལ་མོས་པའོ། །
en: being inspired by emptiness,

source: དངོས་པོས་ཡོངས་སུ་ཚིམ་པ་མ་ཡིན་པའོ། །
en: not being satisfied with things,

source: ཕུང་པོ་ལ་མི་གནས་པའོ། །
en: not fixating on the aggregates,

source: ཁམས་རྣམས་འདུལ་བའོ། །
en: subduing the elements,

source: སྐྱེ་མཆེད་ལ་མི་དམིགས་པ་ཉིད་དོ། །
en: not reifying the sense sources,

source: ཡུལ་ལ་མི་སྟོན་པའོ། །
en: not revering objects,

source: ཕྱིན་ཅི་ལོག་སྤོང་བའོ། །
en: giving up error,

source: སེམས་བརྟན་པོར་བསྒྲུབ་པའོ། །
en: attaining mental stability,

source: འཕགས་པའི་གནས་པའོ། །
en: abiding in the abodes of the noble ones,

source: སེམས་ལ་བརྐམ་ཆགས་མེད་པ་ཉིད་དོ། །
en: having a mind free from craving and yearning,

source: སྦྱིན་གནས་ཀྱི་ས་ཐོབ་པ་ཉིད་དོ། །
en: attaining the level of being worthy of offerings,

source: མངོན་པར་འདུ་བྱེད་པ་ཤིན་ཏུ་སྦྱངས་པའོ། །
en: and completely purifying karmic conditioning.

source: སྦྱིན་པས་རྣམ་པར་སྨིན་པ་མི་ལེན་པའོ། །
en: “It is generosity whereby you do not take on karmic ripening,

source: ཚུལ་ཁྲིམས་ཀྱིས་མི་སྙེམས་པ་ཉིད་དོ། །
en: it is discipline whereby you have no arrogance,

source: བཟོད་པས་རྟོག་པ་མེད་པའོ། །
en: it is patience whereby you have no divisive thoughts,

source: བརྩོན་འགྲུས་ཆུད་ཟ་བ་མེད་པའོ། །
en: it is diligence in which your efforts are not squandered,

source: བསམ་གཏན་གྱིས་སྐྱེ་བ་མེད་པའོ། །
en: it is concentration whereby you do not take rebirth,

source: ཤེས་རབ་ཀྱིས་ཆུད་ཟ་བ་མེད་པའོ། །
en: and it is insight whereby you do not squander life.

source: ས་ལ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཉམ་པ་ཉིད་དོ། །
en: It is equality as the perfection of progressing in the spiritual levels.

source: རང་གི་ཡོན་ཏན་གྱིས་སྙེམས་པ་མེད་པ་ཉིད་དོ། །
en: It is not being conceited about one’s own qualities

source: གཞན་གྱི་ཡོན་ཏན་ལ་སུན་མི་འབྱིན་པའོ། །
en: and not denigrating the good qualities of others.

source: འཁོར་བ་ལ་མི་གནས་པའོ། །
en: It is not remaining in saṃsāra,

source: མྱ་ངན་ལས་འདས་པ་ལ་མི་དམིགས་པ་ཉིད་དོ། །
en: not objectifying nirvāṇa,

source: ཐར་པ་ལ་དབང་དུ་གྱུར་པའོ། །
en: mastering liberation,

source: མྱ་ངན་ལས་འདས་པ་ལ་མ་ཆགས་པའོ། །
en: not being attached to nirvāṇa,

source: དེས་པ་ལ་གནས་པའོ། །
en: and resting in certainty.

source: བཞིན་འཛུམ་པའོ། །
en: It is having a smile on one’s face,

source: ཁྲོ་གཉེར་དང་བྲལ་བ་ཉིད་དོ། །
en: not having an angry frown,

source: གསོང་པོར་སྨྲ་བ་ཉིད་དོ། །
en: and speaking with sincerity.

source: འོས་པའི་ཤེས་རབ་དང་ལྡན་པས་གསར་བུ་དང་། བར་མ་དང་། རྒན་རབས་ལ་བཀུར་སྟི་བྱེད་པའོ། །
en: It is praising novices, midlevel practitioners, and seniors due to their proper understanding.

source: རྣམ་པར་འཚེ་བ་མེད་པ་ཉིད་དོ། །
en: It is being free from animosity,

source: རྩོད་པ་ཞི་བར་བྱེད་པའོ། །
en: pacifying disputes,

source: ཞི་བ་ལ་བསྔགས་པ་རྗོད་པའོ། །
en: praising peace,

source: ཚོགས་པ་ལ་མངོན་པར་བརྩོན་པའོ། །
en: endeavoring in the accumulations,

source: མཛའ་བ་དང་མི་མཛའ་བ་ལ་སེམས་མཉམ་པ་ཉིད་དོ། །
en: and having equal concern for those who are one’s friends and those who are not one’s friends.

source: གཟུངས་འཚོལ་བའོ། །
en: “It is pursuing retention.

source: སེམས་ཅན་རྣམས་ལ་ནི་མ་ལ་སྲི་ཞུ་ཆེ་བ་ལྟ་བུའོ། །
en: It is respectfully serving all beings as if they were one’s mother,

source: མཛངས་པ་ལ་ནི་ཕ་ལ་སྲི་ཞུ་ཆེ་བ་ལྟ་བུའོ། །
en: respectfully serving all wise ones as if they were one’s father,

source: བླ་མ་རྣམས་ལ་ནི་མཁན་པོ་ལ་སྲི་ཞུ་ཆེ་བ་ལྟ་བུའོ། །
en: respectfully serving all masters as if they were one’s own preceptor,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་སངས་རྒྱས་ལ་གུས་པ་ལྟ་བུའོ། །བསྒྲུབ་པ་རྫོགས་པར་བྱེད་པ་ཉིད་དོ། །
en: venerating the bodhisattvas as if they were buddhas,

source: དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱེད་པའོ། །
en: worshiping the thus-gone ones,

source: དགེ་བ་ལ་མོས་པ་ཉིད་དོ། །
en: aspiring to virtue,

source: དཀོན་མཆོག་གསུམ་ལ་ཞུམ་པ་མེད་པས་བཀུར་སྟི་བྱེད་པའོ། །
en: and untiringly venerating the Three Jewels.

source: ཐ་སྙད་ལ་མི་གནས་པར་དང་དུ་ལེན་པ་ཉིད་དོ། །
en: It is joyfully persevering without being involved in worldly affairs,

source: ལུས་ལ་མི་ལྟ་བ་ཉིད་དོ། །
en: not having concern for the body,

source: སྲོག་ལ་ལྷག་པར་ཆགས་པ་མེད་པ་ཉིད་དོ། །
en: not being attached to one’s own life,

source: འཚོ་བ་དག་པར་བྱེད་པའོ། །
en: maintaining a pure livelihood,

source: བསོད་སྙོམས་ལ་རྒྱུ་བ་དག་བརྩོན་པ་མི་སྤོང་བའོ། །
en: not giving up the practice of making alms rounds,

source: ཚོགས་པའི་གནས་ཡོངས་སུ་སྤོང་བའོ། །
en: abandoning places where people gather,

source: ཁྱིམ་པ་རྣམས་ལ་མི་བསྟོད་པའོ། །
en: not praising householders,

source: རབ་ཏུ་བྱུང་བ་རྣམས་ཀྱི་ནང་ན་འདུ་འཛི་ལ་མི་གནས་པའོ། །
en: and not conducting business among those who have gone forth.

source: ཚུལ་འཆོས་པ་མེད་པ་ཉིད་དོ། །
en: It is having no hypocrisy,

source: ཁ་གསག་མེད་པ་ཉིད་དོ། །
en: not engaging in flattery,

source: སྙན་པར་སྨྲ་བ་ཉིད་དོ། །
en: speaking pleasantly,

source: བྱང་ཆུབ་ཡང་དག་པར་ལེན་དུ་འཇུག་པ་ཉིད་དོ། །
en: adhering to the practices of awakening,

source: རང་བཞིན་གྱིས་ཞུམ་པ་མེད་པ་ཉིད་དོ། །
en: being naturally undaunted,

source: ཚུལ་བཞིན་ལ་འཇུག་པའོ། །
en: and engaging in what is appropriate.

source: ཕྱིར་ཞིང་སངས་རྒྱས་ལ་བསྟོད་པ་ཉིད་དོ། །
en: It is offering continuous praise for the Buddha,

source: ཆོས་ལ་རྟག་ཏུ་སེམས་པ་ཉིད་དོ། །
en: always being attentive to the Dharma,

source: དགེ་འདུན་ལ་རྟག་ཏུ་རྗེ་ས་བྱེད་པའོ། །
en: and always following the Saṅgha.

source: ཤེས་པ་དང་ལྡན་པ་རྣམས་ལ་རྟག་ཏུ་མཆོད་པ་བྱེད་པའོ། །
en: It is constantly worshiping those endowed with knowledge,

source: མཛངས་པ་རྣམས་ལ་རྟག་ཏུ་བསྟེན་པའོ། །
en: always relying on those who are erudite,

source: བསམ་གཏན་པ་རྣམས་ལ་རྟག་ཏུ་བསྲུང་བའོ། །
en: always guarding those in meditation,

source: རིགས་པ་དང་ལྡན་པ་རྣམས་ལ་རྟག་ཏུ་སྐུལ་མ་འདེབས་པའོ། །
en: always exhorting those endowed with reason,

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་རྟག་ཏུ་རྟོན་པའོ། །
en: always relying on the teachings of the buddhas,

source: ཆོས་རྣམས་ལ་རྟག་ཏུ་བསྒོམ་པའོ། །
en: always cultivating the Dharma teachings,

source: བསོད་ནམས་ལ་རྟག་ཏུ་ཡིད་ཆེས་པ་ཉིད་དོ། །
en: always trusting in merit,

source: སེམས་ཅན་རྣམས་ལ་རྟག་ཏུ་ཡངས་པའོ། །
en: always being generous to sentient beings,

source: དད་པ་དང་ལྡན་པ་རྣམས་ལ་རྟག་ཏུ་བྱམས་པའོ། །
en: always caring for those who have faith,

source: སྡུག་བསྔལ་དང་ལྡན་པ་རྣམས་སེལ་བའོ། །
en: and bringing relief to those who suffer.

source: སྤྱོད་ལམ་དག་པར་བྱེད་པའོ། །
en: “It is having pure conduct,

source: ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པའོ། །
en: knowing shame and modesty,

source: ངོ་ཚ་བ་དང་འཇིགས་པ་སྟོན་པའི་ཚུལ་ཅན་ནོ། །
en: having a manner that demonstrates shame and fear,

source: སྤྱོད་པ་ངན་པ་སྤོང་བ་ཉིད་དོ། །
en: giving up unwholesome conduct,

source: ཆོ་ག་ལ་བསྟེན་པའོ། །
en: attending to proper conduct,

source: སྤོང་བ་ལ་མངོན་དུ་ཕྱོགས་པའོ། །
en: and being inclined toward renunciation.

source: འཕགས་པའི་གནས་པ་ཚོལ་བའོ། །
en: It is seeking out the abodes of the noble ones,

source: དྲན་པ་ཉེ་བར་གཞག་པ་བསྒོམ་པའོ། །
en: cultivating the applications of mindfulness,

source: ཡང་དག་པར་སྤོང་བ་བསྟེན་པའོ། །
en: relying on the correct abandonments,

source: དབང་པོ་རྣམས་འཛིན་པའོ། །
en: taking hold of the faculties,

source: སྟོབས་རྣམས་ཟིལ་གྱིས་མི་ནོན་པའོ། །
en: accomplishing the powers,

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ལྷག་པར་མཐོང་བའོ། །
en: having special insight into the factors of awakening,

source: ལམ་ལ་ཕྱིན་ཅི་མ་ལོག་པ་ཉིད་དོ། །
en: and being unerring on the path.

source: ཞི་གནས་རྒྱ་ཆེ་བའོ། །
en: It is possessing vast calm abiding,

source: ལྷག་མཐོང་ལ་སྐུལ་མ་འདེབས་པའོ། །
en: rousing special insight,

source: སེམས་བརྗེད་ངས་པ་མེད་པ་ཉིད་དོ། །
en: being free from forgetfulness,

source: ཆོས་ལ་མངོན་པར་དགའ་བའོ། །
en: and having genuine joy in the Dharma.

source: དམིགས་པ་ལས་ཡང་དག་པར་འདས་པའོ། །
en: It is going beyond objective references,

source: མི་གནས་པ་ལ་མི་སྐྲག་པའོ། །
en: not fearing the lack of support,

source: དམིགས་པ་མེད་པ་ལ་བག་མེད་པའི་འདུ་ཤེས་དང་བྲལ་བའོ། །
en: and not confusing the absence of objective references with carelessness.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བསྲུང་བ་ཉིད་དོ། །
en: It is abiding by the conduct of the bodhisattvas,

source: སངས་རྒྱས་ཀྱི་སྤྱོད་པ་ཚད་མེད་པར་བྱེད་པའོ། །
en: engaging in the infinite conduct of the buddhas,

source: མི་འཐུན་པའི་སྤྱོད་པ་ལ་སྨོད་པ་ཉིད་དོ། །
en: having scorn for unwholesome conduct,

source: སྔོན་གྱི་མངོན་པར་འདུ་བྱེད་པ་ལ་ཡིད་བྱུང་བའོ། །
en: being saddened by past karmic formations,

source: རང་གི་ལས་ཡོངས་སུ་སྦྱོང་ཞིང་འདུལ་བ་མ་ཡིན་པ་སྦེད་པའོ། །
en: purifying one’s own karma, and taking charge of what has not yet been tamed.

source: བསྟན་པ་སུན་མི་འབྱིན་པའོ། །
en: “It is never disparaging the teachings,

source: ཐེ་ཙོམ་མི་འཛིན་པའོ། །
en: not harboring doubts,

source: དུས་སུ་སྤྱོད་པ་ཉིད་དོ། །
en: acting in timely ways,

source: དུས་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་ཉིད་དོ། །
en: giving up what is not timely,

source: འགྲོ་བ་དང་ལྡོག་པ་ལ་མཁས་པའོ། །
en: having skill in going and returning,

source: ཚོད་ཤེས་པ་ཉིད་དོ། །
en: knowing limits,

source: ཡོ་བྱད་ཀྱིས་ཆོག་ཤེས་པའོ། །
en: being content regarding material things,

source: མངོན་པར་ཤེས་པ་རྒྱ་ཆེ་བའོ། །
en: having vast superknowledge,

source: ཏིང་ངེ་འཛིན་ཁོང་དུ་ཆུད་པའོ། །
en: mastering absorption,

source: སྤྱོད་པའི་བྱེ་བྲག་ཅན་ནོ། །
en: having diverse modes of conduct,

source: སྙིང་སྟོབས་རྒྱ་ཆེ་བའོ། །
en: and having vast courage.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བསྟན་པའོ། །
en: It is the teachings of the thus-gone ones,

source: མི་དམིགས་པས་ཡོངས་སུ་བཟུང་བའོ། །
en: being fully receptive through nonapprehension,

source: བརྩོན་པ་དང་ལྡན་པ་རྣམས་ཚིམ་པར་བྱེད་པའོ། །
en: satisfying the diligent,

source: སངས་རྒྱས་ཀྱི་སྲས་རྣམས་ཀྱིས་བསྒོམ་པའོ། །
en: cultivation by the children of the buddhas,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནོར་ཡིན་ནོ། །
en: the wealth of the bodhisattvas,

source: སངས་རྒྱས་རྣམས་ཀྱི་གནས་པའོ། །
en: the abiding of the buddhas,

source: མཁས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: and the practice of the learned,

source: ཅང་ཤེས་ཀྱི་འགྲོས་ཀྱི་སྤྱོད་ཡུལ་བའོ། །
en: the domain of intelligent progress,

source: ཆོས་སྨྲ་བ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ལོ། །
en: and the domain of the teachers of the Dharma.

source: མོས་པ་མང་བ་རྣམས་ལ་སྐུལ་མ་འདེབས་པའོ། །
en: It is inspiration for the highly motivated,

source: འཇིག་རྟེན་གསུམ་གྱི་མགོན་པོ་མཐོང་བའི་ཚུལ་ཅན་ནོ། །
en: the disposition to behold the protectors of the three worlds,

source: ནོར་དོན་དུ་གཉེར་བ་རྣམས་ཀྱི་མཛོད་དོ། །
en: a treasury for those in pursuit of wealth,

source: རྣམ་པར་སྨིན་པ་དང་ལྡན་པ་རྣམས་ཀྱི་ཞིང་ངོ་། །
en: and a field of those endowed with ripening.

source: གདུངས་པ་རྣམས་ཀྱི་ཀུན་དགའ་ར་བའོ། །
en: It is true happiness for the tormented,

source: གཟུངས་ཐོབ་པ་རྣམས་ཀྱི་སྐྱེད་མོས་ཚལ་ལོ། །
en: a park for those who have achieved retention,

source: ཏིང་ངེ་འཛིན་ཐོབ་པ་རྣམས་ཀྱི་རྫིང་ངོ་། །
en: a pool for those who have attained absorption,

source: ཆོས་དཀར་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མའོ། །
en: a mother for those endowed with virtuous qualities,

source: གཏམ་ལ་མོས་པ་རྣམས་ཀྱི་གནས་སོ། །
en: a support for those inspired by speech,

source: མཚན་རྣམས་ཀྱི་རྒྱུའོ། །
en: the cause of the major marks of the buddhas,

source: དཔེ་བྱད་རྣམས་རྣམ་པར་འབྱེད་པའོ། །
en: the discernment of the minor marks,

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་པའི་གནས་སོ། །
en: and the refuge of the buddha realms.

source: གཟུངས་རབ་ཏུ་ཐོབ་པའོ། །
en: It is the full attainment of retention,

source: བསྒྲུབ་པ་ཁོང་དུ་ཆུད་པའོ། །
en: mastery of attainment,

source: ཤིན་ཏུ་རིགས་པར་སྨྲ་བ་ཉིད་དོ། །
en: and perfectly reasonable speech.

source: བདུད་ཀྱི་ཡུལ་ལས་འདས་པའོ། །
en: “It is transcendence of the realm of the māras,

source: དཔའ་བོ་རྣམས་ཀྱི་ཡུལ་ལོ། །
en: the realm of heroes,

source: ཉོན་མོངས་པ་འཇོམས་པའོ། །
en: conquering the emotional defilements,

source: མི་དགེ་བ་འཇིལ་བའོ། །
en: demolishing unvirtuous actions,

source: སྨོན་ལམ་དང་ལྡན་པ་རྣམས་ཀྱི་རྒྱན་ནོ། །
en: the adornment of those with aspirations,

source: བདུད་ཀྱིས་མི་ཕྱེད་པའོ། །
en: and invulnerability to the māras.

source: བསྟན་པ་ཟད་མི་ཤེས་པའོ། །
en: It is the inexhaustible teachings,

source: མུ་སྟེགས་ཅན་རྣམས་ཀྱིས་ཤེས་པར་དཀའ་བའོ། །
en: what is hard to fathom for non-Buddhist sectarians,

source: འཇིག་རྟེན་དང་མི་མཚུངས་པའོ། །
en: what is dissimilar to the world,

source: ཉན་ཐོས་ཀྱི་ཆོས་ལས་འདས་པའོ། །
en: what transcends the Dharma of the hearers,

source: རང་བྱང་ཆུབ་ཀྱིས་ངེས་པར་མ་བྱུང་བའོ། །
en: and what is not the deliverance of the solitary buddhas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་དག་པར་ཞུགས་པའོ། །
en: It is attaining omniscience,

source: སེམས་ཅན་གྱི་འགྲོ་བ་ལ་འཇུག་པའོ། །
en: entering the existences of sentient beings,

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྐུལ་མ་འདེབས་པའོ། །
en: and inspiration for the ultimate state of reality.

source: བཟའ་བ་འདོད་པ་རྣམས་དགའ་བར་བྱེད་པའོ། །
en: It is delighting those wishing for food,

source: བཏུང་བ་འདོད་པ་རྣམས་ཀྱི་རོ་བྲོ་བའོ། །
en: and satisfying those thirsting for drink.

source: མྱ་ངན་ལས་འདས་པར་འགྲོ་བ་རྣམས་ཀྱི་སྙིང་པོའོ། །
en: It is the essence of those who attain nirvāṇa,

source: མྱ་ངན་ལས་འདས་པར་འགྲོ་བ་རྣམས་ཀྱི་ཤིང་རྟའོ། །
en: the chariot of those who attain nirvāṇa,

source: ཕ་རོལ་ཏུ་འགྲོ་བ་རྣམས་ཀྱི་གྲུའོ། །
en: the boat for sailing to the other shore,

source: རྒལ་འདོད་པ་རྣམས་ཀྱི་གཟིངས་སོ། །
en: the boat for those wishing to cross,

source: སྙིང་རྗེ་ཅན་རྣམས་ཀྱི་མར་མེའོ། །
en: the lamp for the compassionate,

source: ཆོས་སྟོན་པ་རྣམས་ཀྱི་སྐར་མདའོ། །
en: the shooting star for the teachers of Dharma,

source: མི་སླུ་བར་འདོད་པ་རྣམས་ཀྱི་གནས་སོ། །
en: the abode of those wishing for freedom from deception,

source: སྦྱིན་པར་འདོད་པ་རྣམས་ཀྱི་ནོར་ཡིན་ནོ། །
en: wealth for those wishing to give,

source: གྲོལ་བར་འདོད་པ་རྣམས་ཀྱི་རིག་པའོ། །
en: knowledge for those wishing for liberation,

source: རྩེད་མོ་དོན་དུ་གཉེར་བ་རྣམས་དང་བར་བྱེད་པའོ། །
en: ennoblement for those in pursuit of amusements,

source: ཉན་པའི་བསམ་པ་ཅན་རྣམས་ཀྱི་རྒྱ་མཚོའོ། །
en: an ocean for those wishing to learn,

source: ཏིང་ངེ་འཛིན་ཐོབ་པ་རྣམས་ཀྱི་རི་རབ་བོ། །
en: Mount Sumeru for those who accomplish absorption,

source: མིག་ལ་དགའ་བ་རྣམས་ཀྱི་དབང་པོའོ། །
en: a sense faculty for those who desire eyes,

source: བལྟ་འདོད་པ་རྣམས་ཀྱི་བཀོད་པའོ། །
en: a display for those wishing to see,

source: སེམས་དང་ལྡན་པ་རྣམས་དགའ་བའོ། །
en: delight for those endowed with mind,

source: ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱི་གནས་སོ། །
en: the abode of nonregression,

source: མི་སྐྱེ་བའི་བཟོད་པ་ཐོབ་པ་རྣམས་ཀྱི་བསམ་པའོ། །
en: and the intention of those who have attained acceptance that phenomena are unborn.

source: ལས་དང་པོ་པ་རྣམས་ཀྱི་བསྒོམ་པའོ། །
en: “It is the cultivation of beginners,

source: སྐྱེས་བུ་ཤེས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་རྒྱལ་མཚན་ནོ། །
en: the banner of people with understanding,

source: ཞི་གནས་ལ་བཀུར་སྟི་བྱེད་པ་རྣམས་ཀྱི་བྱང་ཆུབ་བོ། །
en: the awakening of those who revere calm abiding,

source: བདག་མེད་པར་སྨྲ་བ་རྣམས་ཀྱི་སྲེད་མེད་ཀྱི་བུའོ། །
en: and the Nārāyaṇa of those who teach the absence of self.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་མོ། །
en: It is the path of omniscience,

source: ཡེ་ཤེས་དང་རྣམ་པར་གྲོལ་བ་རྣམས་ཀྱི་སྐྱེ་བ་མཉམ་པ་ཉིད་དོ། །
en: the equality of birth for those with wisdom and liberation,

source: ལྷ་རྣམས་ཀྱིས་བསྔགས་པའོ། །
en: what is praised by the gods,

source: ཀླུ་རྣམས་ཀྱིས་བརྗེད་པའོ། །
en: what is extolled by the nāgas,

source: མི་རྣམས་ཀྱིས་མཆོད་པའོ། །
en: what is worshiped by humans,

source: སློབ་པ་རྣམས་ཀྱིས་ངོ་མཚར་དུ་བྱས་པའོ། །
en: what inspires wonder in those in training,

source: མི་སློབ་པ་རྣམས་ཀྱིས་ཕྱག་བྱས་པའོ། །
en: what is revered by those beyond training,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསྟོད་པའོ། །
en: what is applauded by the bodhisattvas,

source: ཆོས་ཀྱི་རྗེ་རྣམས་ཀྱིས་བསྒོམས་པའོ། །
en: and what is cultivated by the lords of Dharma.

source: དབང་པོ་སྦས་པ་རྣམས་ཀྱི་གྲོང་ཁྱེར་རོ། །
en: It is the city of those who guard their faculties,

source: ཐབས་མཁས་པ་རྣམས་ཀྱི་ཚུལ་ལོ། །
en: the way of skillful ones,

source: བརྩོན་པ་རྣམས་ཀྱི་རྙེད་པའོ། །
en: the attainment of the diligent,

source: ཐེ་ཙོམ་རྣམས་སེལ་བའོ། །
en: the dispelling of doubts,

source: ཡིད་གཉིས་གཅོད་པའོ། །
en: cutting through doubts,

source: ཉོན་མོངས་པ་རྣམས་སེལ་བའོ། །
en: dispelling the defilements,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་སོ། །
en: and the retentions of the bodhisattvas.

source: ནད་པ་རྣམས་ཀྱི་སྨན་པའོ། །
en: It is a doctor for the sick,

source: ཕྱིན་ཅི་ལོག་པ་རྣམས་གསོ་བའོ། །
en: a remedy for error,

source: ཟུག་རྔུ་རྣམས་འབྱིན་པའོ། །
en: and a reliever of pain.

source: བརྩོན་པར་འདོད་པ་རྣམས་ཡིད་ལ་བྱེད་པའོ། །
en: It is the contemplation for those wishing to persevere,

source: སྒྲོགས་པར་འདོད་པ་རྣམས་ཀྱི་མི་འཇིགས་པའོ། །
en: fearlessness for those wishing to proclaim,

source: སྨྲ་བར་འདོད་པ་རྣམས་ཀྱི་སོ་སོ་ཡང་དག་པར་རིག་པ་རྒྱ་ཆེ་བའོ། །
en: vast and genuine knowledge for those wishing to speak,

source: རྣམ་པར་འཕྲུལ་པར་འདོད་པ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་ལོ། །
en: miraculous abilities for those wishing to perform miracles,

source: ཉན་འདོད་པ་རྣམས་ཀྱི་འགྲོ་བའོ། །
en: a journey for those wishing to hear,

source: བལྟ་འདོད་པ་རྣམས་ཀྱི་མིག་གོ། །
en: eyes for those wishing to see,

source: མྱ་ངན་ལས་འདས་པའི་ལམ་མོ། །
en: the path to nirvāṇa,

source: ངན་སོང་རྣམས་སྤོང་བའོ། །
en: relinquishing the lower realms,

source: འདོད་པ་དང་། གཟུགས་དང་།
en: transcending the realms of desire,

source: གཟུགས་མེད་པ་དག་ལས་འདས་པའོ། །
en: form, and formlessness,

source: སངས་རྒྱས་ཀྱི་ཞིང་དག་རྣམ་པར་བསྒྲུབ་པའོ། །
en: and accomplishing the realms of the buddhas.

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལེན་པའོ། །
en: “It is embracing the vajra-like absorption,

source: སྲིད་པ་ཐ་མ་པ་དག་སེང་གེའི་གདན་ལ་འདུག་པའོ། །
en: the lion throne for those in their final existence,

source: ཆུད་ཟ་བ་མེད་པར་དོན་དུ་གཉེར་བ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དོ། །
en: the roots of virtue for those who pursue nondegeneracy,

source: སྐྱོ་བ་རྣམས་དགའ་བར་བྱེད་པའོ། །
en: giving joy to the sad,

source: ལྷུང་བ་རྣམས་འདེག་པའོ། །
en: uplifting the downtrodden,

source: རྩོམ་པ་རྣམས་བརྟན་པོར་བྱེད་པའོ། །
en: fortifying the diligent,

source: སྤྱོད་པའི་ཁམས་རྣམ་པར་བསྒྲུབ་པའོ། །
en: and accomplishing the dispositions of conduct.

source: སྙོམ་ལས་བྱེད་པ་དག་ཡིད་ལ་བྱེད་པའོ། །
en: It is contemplation for the idle,

source: ཐེག་པ་གསུམ་མཉམ་པ་ཉིད་ཀྱི་བཀའ་ཡིན་ནོ། །
en: the declaration of the equality of the three vehicles,

source: འཛིན་པ་ཐམས་ཅད་སྤངས་པའོ། །
en: abandoning all grasping,

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པའོ། །
en: perfecting omniscience,

source: དོན་དམ་པ་སྨྲ་བ་རྣམས་ཀྱི་སྒོ་མཐའ་ཡས་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པའོ། །
en: thoroughly attaining the infinite gateways of those who teach the ultimate,

source: སྟོང་པ་ཉིད་སྨྲ་བ་རྣམས་ཀྱི་ཆོས་ཆུད་མི་ཟ་བའོ། །
en: ensuring that the qualities of the teaching of emptiness are not wasted,

source: སྨོན་ལམ་གྱི་སྒོའི་ཤུགས་མཐར་ཕྱིན་པའོ། །
en: and perfecting the strength of the gateways of aspiration.

source: མཚན་མ་མེད་པ་ལ་མོས་པ་རྣམས་ལ་བརྡ་སྤྲོད་པའོ། །
en: It is communication for those who are inspired toward the absence of marks,

source: མཐོང་བ་དང་། བཏང་སྙོམས་ལ་མོས་པ་རྣམས་ཀྱི་དུས་གསུམ་མཉམ་པ་ཉིད་དོ། །
en: the equality of the three times for those who are inspired toward seeing and equanimity,

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་ལ་ཐབས་མཁས་པའོ། །
en: skill in universal outreach,

source: བྱང་ཆུབ་ཡོངས་སུ་སྟོན་པའོ། །
en: and teaching awakening.

source: ཕ་རོལ་པོས་སྤ་དགོང་དུ་མེད་པའོ། །
en: It is not being vulnerable to denigration by others.

source: ཆོས་སྨྲ་བ་ལ་མ་འཁྲུལ་བར་ཚོལ་བ་ཉིད་དོ། །
en: “It is the Dharma teachers’ pursuit of freedom from delusion,

source: ཟང་ཟིང་མེད་པར་ཆོས་སྨྲ་བ་ལ་ཡང་དག་པར་བསྟེན་པའོ། །
en: following Dharma teachers who are free of materialistic concerns,

source: ཆོས་མཉན་པ་ལ་གཡེང་བ་མེད་པའོ། །
en: and listening to the Dharma without distraction.

source: འཁོར་ལ་བརྙས་པ་མེད་པའོ། །
en: It is the unblemished retinue,

source: ཆོས་ཀྱི་སྦྱིན་པ་ལ་བར་ཆད་མེད་པའོ། །
en: the absence of obstacles for giving the Dharma,

source: ངེས་པ་རྣམས་ཀྱི་དྲི་བ་ལ་ངོ་མཚར་དུ་བྱེད་པའོ། །
en: causing amazement in those who ask questions with conviction,

source: འགྱོད་པ་རྣམ་པར་སེལ་བའོ། །
en: dispelling regret,

source: སྦྱོར་བ་ལ་རྒྱུན་ཆད་པ་མེད་པའོ། །
en: continuous engagement,

source: ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་མི་གཏོང་བའོ། །
en: not abandoning the accumulation of wisdom,

source: འཛིན་པ་ལ་གནས་པ་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བའོ། །
en: the liberation of those who grasp,

source: མ་རུངས་པ་རྣམས་དུལ་བར་བྱེད་པའོ། །
en: the taming of those who are offensive,

source: ཉོན་མོངས་པ་རྣམས་འདོར་བའོ། །
en: and shedding the defilements.

source: མི་གནས་པ་ལ་སྤྱོད་པའོ། །
en: It is practicing without supports,

source: རྗེས་སུ་དྲན་པ་འདོད་པ་རྣམས་ཀྱི་དྲན་པའོ། །
en: being mindful of those wishing for mindfulness,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སློང་བར་བྱེད་པའོ། །
en: uplifting the bodhisattvas,

source: འཁོར་བཞི་ལ་སྟོན་པའོ། །
en: teaching the fourfold retinue,

source: རོ་བྲོ་བ་རྣམས་ཀྱི་ནང་ན་མངར་བའོ། །
en: and the sweetest among delicious tastes.

source: རྣམ་པར་འཕྲུལ་པར་འདོད་པ་རྣམས་ཀྱི་སྒྲ་སྒྲོགས་པའོ། །
en: It is a declaration for those wishing for miraculous abilities,

source: སྲིད་པ་ལས་ལྡོག་པར་འདོད་པ་རྣམས་ཀྱི་སྒོ་འབྱེད་པའོ། །
en: an open door for those wishing to turn back from existence,

source: མྱ་ངན་ལས་འདས་པར་ཐར་པའོ། །
en: the liberation in nirvāṇa,

source: ལུས་བདེ་བའོ། །
en: a blissful body,

source: སེམས་བདེ་བའོ། །
en: a blissful mind,

source: མཁས་པ་རྣམས་དགའ་བའོ། །
en: the joy of the wise,

source: ཡི་དམ་ལ་བརྟན་པ་རྣམས་མི་གཏོང་བའོ། །
en: the nonabdication of firm commitments,

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ལས་མི་ལྡོག་པའོ། །
en: and the undeterred attainment of the qualities of the thus-gone ones.

source: དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་གནས་སོ། །
en: “It is the abode of the roots of virtue,

source: མི་དགེ་བ་རྣམས་ངེས་པར་འཇོམས་པའོ། །
en: the destruction of nonvirtue,

source: འཆལ་པའི་ཤེས་རབ་ཅན་རྣམས་ཀྱི་བསླབ་པའོ། །
en: training for those with misguided intelligence,

source: རིགས་པ་ལ་གནས་པ་རྣམས་ཀྱི་གནས་སོ། །
en: the abode of those adhering to reason,

source: སླུ་བ་མེད་པར་མཚོན་པའོ། །
en: the nondeceptive guide,

source: སངས་རྒྱས་ཀྱི་སྣང་བ་སྒྲུབ་པའོ། །
en: the attainment of the light of the buddhas,

source: ཡེ་ཤེས་ཀྱི་ཕུང་པོའི་སྣང་བའོ། །
en: the light of the mass of wisdom,

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོན་པའོ། །
en: and displaying the realms of the buddhas.

source: དྲི་བ་བྱེ་བ་སྙེད་འདྲི་བའོ། །
en: It is the posing of millions of questions,

source: ཆོས་དཀར་པོ་དག་ལ་རྟག་པའོ། །
en: thinking of virtuous qualities,

source: སྐྱོ་བའི་བློ་ཅན་རྣམས་ཀྱི་དམིགས་པའོ། །
en: a focal point for the weary,

source: ཤེས་རབ་ཆུང་བ་རྣམས་ཆུད་མི་ཟ་བའོ། །
en: not forsaking those of poor intelligence,
